## 🧾 Terraform Plan for `sec_ssm_baseline`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sec_ssm_baseline_advanced.aws_ssm_association.patching will be created
  + resource "aws_ssm_association" "patching" {
      + apply_only_at_cron_interval      = false
      + arn                              = (known after apply)
      + association_id                   = (known after apply)
      + automation_target_parameter_name = "InstanceId"
      + compliance_severity              = "HIGH"
      + document_version                 = "$LATEST"
      + id                               = (known after apply)
      + name                             = "PatchingAssociation-bluebit-hardened-config"
      + parameters                       = (known after apply)
      + schedule_expression              = "cron(0 3 ? * SUN *)"

      + targets {
          + key    = "InstanceIds"
          + values = [
              + "i-0abcdef1234567890",
              + "i-0987654321fedcba0",
            ]
        }
    }

  # module.sec_ssm_baseline_advanced.aws_ssm_association.secure_config will be created
  + resource "aws_ssm_association" "secure_config" {
      + apply_only_at_cron_interval = false
      + arn                         = (known after apply)
      + association_id              = (known after apply)
      + document_version            = "$LATEST"
      + id                          = (known after apply)
      + name                        = "SecureConfigAssociation-bluebit-hardened-config"
      + parameters                  = (known after apply)

      + targets {
          + key    = "InstanceIds"
          + values = [
              + "i-0abcdef1234567890",
              + "i-0987654321fedcba0",
            ]
        }
    }

  # module.sec_ssm_baseline_advanced.aws_ssm_document.baseline_config will be created
  + resource "aws_ssm_document" "baseline_config" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + default_version  = (known after apply)
      + description      = (known after apply)
      + document_format  = "JSON"
      + document_type    = "Command"
      + document_version = (known after apply)
      + hash             = (known after apply)
      + hash_type        = (known after apply)
      + id               = (known after apply)
      + latest_version   = (known after apply)
      + name             = "bluebit-hardened-config"
      + owner            = (known after apply)
      + parameter        = (known after apply)
      + platform_types   = (known after apply)
      + schema_version   = (known after apply)
      + status           = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.sec_ssm_baseline_advanced.aws_ssm_patch_baseline.this will be created
  + resource "aws_ssm_patch_baseline" "this" {
      + approved_patches                  = [
          + "patch-xyz-2024",
        ]
      + approved_patches_compliance_level = "UNSPECIFIED"
      + arn                               = (known after apply)
      + id                                = (known after apply)
      + name                              = "bluebit-prod-baseline"
      + operating_system                  = "AMAZON_LINUX_2"
      + rejected_patches_action           = (known after apply)
      + tags                              = {
          + "Compliance"  = "CIS"
          + "Environment" = "production"
          + "Module"      = "sec_ssm_baseline"
          + "Owner"       = "security-team"
        }
      + tags_all                          = {
          + "Compliance"  = "CIS"
          + "Environment" = "production"
          + "Module"      = "sec_ssm_baseline"
          + "Owner"       = "security-team"
        }

      + approval_rule {
          + approve_after_days  = 3
          + compliance_level    = "HIGH"
          + enable_non_security = true

          + patch_filter {
              + key    = "CLASSIFICATION"
              + values = [
                  + "Security",
                  + "Bugfix",
                ]
            }
          + patch_filter {
              + key    = "SEVERITY"
              + values = [
                  + "Critical",
                  + "Important",
                  + "Medium",
                ]
            }
        }
    }

  # module.sec_ssm_baseline_basic.aws_ssm_association.patching will be created
  + resource "aws_ssm_association" "patching" {
      + apply_only_at_cron_interval      = false
      + arn                              = (known after apply)
      + association_id                   = (known after apply)
      + automation_target_parameter_name = "InstanceId"
      + compliance_severity              = "HIGH"
      + document_version                 = "$LATEST"
      + id                               = (known after apply)
      + name                             = "PatchingAssociation-bluebit-secure-config"
      + parameters                       = (known after apply)
      + schedule_expression              = "rate(7 days)"

      + targets {
          + key    = "InstanceIds"
          + values = [
              + "i-0123456789abcdef0",
            ]
        }
    }

  # module.sec_ssm_baseline_basic.aws_ssm_association.secure_config will be created
  + resource "aws_ssm_association" "secure_config" {
      + apply_only_at_cron_interval = false
      + arn                         = (known after apply)
      + association_id              = (known after apply)
      + document_version            = "$LATEST"
      + id                          = (known after apply)
      + name                        = "SecureConfigAssociation-bluebit-secure-config"
      + parameters                  = (known after apply)

      + targets {
          + key    = "InstanceIds"
          + values = [
              + "i-0123456789abcdef0",
            ]
        }
    }

  # module.sec_ssm_baseline_basic.aws_ssm_document.baseline_config will be created
  + resource "aws_ssm_document" "baseline_config" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + default_version  = (known after apply)
      + description      = (known after apply)
      + document_format  = "JSON"
      + document_type    = "Command"
      + document_version = (known after apply)
      + hash             = (known after apply)
      + hash_type        = (known after apply)
      + id               = (known after apply)
      + latest_version   = (known after apply)
      + name             = "bluebit-secure-config"
      + owner            = (known after apply)
      + parameter        = (known after apply)
      + platform_types   = (known after apply)
      + schema_version   = (known after apply)
      + status           = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.sec_ssm_baseline_basic.aws_ssm_patch_baseline.this will be created
  + resource "aws_ssm_patch_baseline" "this" {
      + approved_patches_compliance_level = "UNSPECIFIED"
      + arn                               = (known after apply)
      + id                                = (known after apply)
      + name                              = "baseline-linux"
      + operating_system                  = "AMAZON_LINUX_2"
      + rejected_patches_action           = (known after apply)
      + tags                              = {
          + "Environment" = "dev"
          + "Owner"       = "ops"
        }
      + tags_all                          = {
          + "Environment" = "dev"
          + "Owner"       = "ops"
        }

      + approval_rule {
          + approve_after_days  = 7
          + compliance_level    = "CRITICAL"
          + enable_non_security = false

          + patch_filter {
              + key    = "CLASSIFICATION"
              + values = [
                  + "Security",
                ]
            }
          + patch_filter {
              + key    = "SEVERITY"
              + values = [
                  + "Critical",
                  + "Important",
                ]
            }
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->